---
kind: method
id: M:Autodesk.Revit.DB.TemporaryGraphicsManager.GetAll
source: html/24142a59-8423-33da-9801-1792224379eb.htm
---
# Autodesk.Revit.DB.TemporaryGraphicsManager.GetAll Method

Returns all temporary graphics object indexes managed by this manager.

## Syntax (C#)
```csharp
public ICollection<int> GetAll()
```

## Returns
Collection of temporary graphics object indexes managed by this manager.